report/stage_2/profiling/wrk2_range_put.txt
$ wrk2 -c 128 -t 8 -d 65s -R 70000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_range_put.txt


Running 1m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.024ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.006ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.017ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.029ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.002ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.999ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.007ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.018ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.02ms    0.99ms  76.22ms   97.52%
    Req/Sec     9.22k   576.67    19.22k    78.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96ms
 75.000%    1.32ms
 90.000%    1.61ms
 99.000%    2.45ms
 99.900%    5.85ms
 99.990%   44.58ms
 99.999%   63.36ms
100.000%   76.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.020     0.000000            1         1.00
       0.398     0.100000       385877         1.11
       0.545     0.200000       771500         1.25
       0.682     0.300000      1155136         1.43
       0.818     0.400000      1538497         1.67
       0.958     0.500000      1924514         2.00
       1.029     0.550000      2116438         2.22
       1.101     0.600000      2308288         2.50
       1.173     0.650000      2499527         2.86
       1.246     0.700000      2690990         3.33
       1.322     0.750000      2885177         4.00
       1.361     0.775000      2980727         4.44
       1.402     0.800000      3076742         5.00
       1.445     0.825000      3173246         5.71
       1.491     0.850000      3268181         6.67
       1.543     0.875000      3364038         8.00
       1.573     0.887500      3412990         8.89
       1.605     0.900000      3460164        10.00
       1.641     0.912500      3507970        11.43
       1.684     0.925000      3556795        13.33
       1.733     0.937500      3604360        16.00
       1.762     0.943750      3628262        17.78
       1.795     0.950000      3652519        20.00
       1.832     0.956250      3676049        22.86
       1.877     0.962500      3700141        26.67
       1.933     0.968750      3724427        32.00
       1.966     0.971875      3736200        35.56
       2.005     0.975000      3748163        40.00
       2.053     0.978125      3760190        45.71
       2.115     0.981250      3772439        53.33
       2.193     0.984375      3784180        64.00
       2.247     0.985938      3790317        71.11
       2.311     0.987500      3796186        80.00
       2.395     0.989062      3802268        91.43
       2.499     0.990625      3808203       106.67
       2.635     0.992188      3814189       128.00
       2.721     0.992969      3817188       142.22
       2.825     0.993750      3820190       160.00
       2.947     0.994531      3823221       182.86
       3.095     0.995313      3826220       213.33
       3.283     0.996094      3829212       256.00
       3.393     0.996484      3830708       284.44
       3.533     0.996875      3832196       320.00
       3.705     0.997266      3833718       365.71
       3.913     0.997656      3835204       426.67
       4.187     0.998047      3836701       512.00
       4.367     0.998242      3837453       568.89
       4.587     0.998437      3838207       640.00
       4.879     0.998633      3838961       731.43
       5.287     0.998828      3839707       853.33
       5.947     0.999023      3840457      1024.00
       6.475     0.999121      3840831      1137.78
       7.379     0.999219      3841207      1280.00
       9.599     0.999316      3841582      1462.86
      15.119     0.999414      3841957      1706.67
      20.927     0.999512      3842332      2048.00
      23.935     0.999561      3842520      2275.56
      26.895     0.999609      3842709      2560.00
      29.823     0.999658      3842897      2925.71
      32.831     0.999707      3843084      3413.33
      35.711     0.999756      3843271      4096.00
      37.311     0.999780      3843366      4551.11
      38.719     0.999805      3843460      5120.00
      40.191     0.999829      3843553      5851.43
      41.695     0.999854      3843646      6826.67
      43.071     0.999878      3843740      8192.00
      43.871     0.999890      3843788      9102.22
      44.671     0.999902      3843835     10240.00
      45.535     0.999915      3843881     11702.86
      46.943     0.999927      3843930     13653.33
      48.447     0.999939      3843976     16384.00
      48.991     0.999945      3843999     18204.44
      50.015     0.999951      3844023     20480.00
      50.783     0.999957      3844045     23405.71
      51.999     0.999963      3844069     27306.67
      52.895     0.999969      3844094     32768.00
      53.535     0.999973      3844106     36408.89
      54.143     0.999976      3844117     40960.00
      54.527     0.999979      3844127     46811.43
      55.199     0.999982      3844139     54613.33
      56.735     0.999985      3844151     65536.00
      58.303     0.999986      3844157     72817.78
      60.063     0.999988      3844163     81920.00
      61.855     0.999989      3844168     93622.86
      63.711     0.999991      3844174    109226.67
      66.943     0.999992      3844181    131072.00
      67.263     0.999993      3844183    145635.56
      68.735     0.999994      3844186    163840.00
      69.119     0.999995      3844189    187245.71
      70.655     0.999995      3844192    218453.33
      72.255     0.999996      3844195    262144.00
      72.383     0.999997      3844196    291271.11
      72.639     0.999997      3844198    327680.00
      72.703     0.999997      3844199    374491.43
      74.111     0.999998      3844201    436906.67
      74.175     0.999998      3844202    524288.00
      74.431     0.999998      3844203    582542.22
      74.495     0.999998      3844204    655360.00
      74.495     0.999999      3844204    748982.86
      75.839     0.999999      3844205    873813.33
      75.903     0.999999      3844206   1048576.00
      75.903     0.999999      3844206   1165084.44
      75.967     0.999999      3844207   1310720.00
      75.967     0.999999      3844207   1497965.71
      75.967     0.999999      3844207   1747626.67
      76.095     1.000000      3844208   2097152.00
      76.095     1.000000      3844208   2330168.89
      76.095     1.000000      3844208   2621440.00
      76.095     1.000000      3844208   2995931.43
      76.095     1.000000      3844208   3495253.33
      76.287     1.000000      3844209   4194304.00
      76.287     1.000000      3844209          inf
#[Mean    =        1.019, StdDeviation   =        0.989]
#[Max     =       76.224, Total count    =      3844209]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4547207 requests in 1.08m, 290.55MB read
Requests/sec:  69960.02
Transfer/sec:      4.47MB